////
//// Created by shuncs on 19-2-24.
////
//
//#include <stdio.h>
//
//int main(void)
//{
//    int a[2][3] = {{1,2,3}, {4,5,6}};
//
//    //对元素取地址
//    //p不一定指向数组的第一个元素，只要寻址的时候不越界即可
//    //a[0] = &a[0][0]
//    int *p = &a[0][0];
//
//    //利用p去遍历整个数组
//    for(int i=0;i<2*3;i++)
//    {
//        //这个遍历方式表明---数组在内存中的存放是连续的
//        printf("%d\t", *(p+i));
//        //也可以进行下标运算，下标运算并不是数组的本质，只是一种寻址方式
//        //printf("%d\t", p[i]);
//    }
//    printf("\n");
//
//    //利用小数组地址
//    //&a[0] == a
//    int (*p1)[3] = &a[0];
//    //*p1 = a[0]
//    //*(p1+1) = a[1]
//    for(int i=0;i<2;i++)
//    {
//        for(int j=0;j<3;j++)
//            //printf("%d\t", *(*(p1+i)+j));
//            //printf("%d\t", (*(p1+i))[j]);
//            printf("%d\t", p1[i][j]);
//    }
//    printf("\n");
//
//    //直接对整个数组取地址
//    int (*p3)[2][3] = &a;
//    for(int i=0;i<2;i++)
//    {
//        for(int j=0;j<3;j++)
//            //printf("%d\t", *(*(*p3+i))+j);
//            printf("%d\t", (*p3)[i][j]);
//    }
//    printf("\n");
//
//    printf("%d\n", sizeof(p));
//
//    return 0;
//}