//
// Created by zhushuai on 19-2-16.
//

#include <stdio.h>

int main(void)
{
    printf("-------while循环---------\n");
    int i = 1;
    //循环条件非0即1，负数也为真
    while (i<=5)    //i是循环控制变量
    {
        printf("i=%d\n", i);
        i++;
    }

    //逻辑运算符的短路原则
    //对于逻辑与---有0则为假
    //对于逻辑或---有1则为真
    int a = 0;
    int b = 2;
    (a = 2 > 1) || (b = 3);
    //2>1为真，所以a=1；左半边为真，所以右边短路，所以b仍为2；
    printf("a=%d\tb=%d\n", a, b);
    (a = 2 > 1) && (b = 3);
    //2>1为真，所以a=1；左半边为真，右半边为真，所以b=3;；
    printf("a=%d\tb=%d\n", a, b);

    printf("---------for循环---------\n");
    int m;
    //循环控制变量的赋值
    //循环条件
    //循环控制变量的变化
    //for(语句1;语句2;语句3)
    //初始先执行语句1，后执行语句2，执行代码块，在执行语句3
    //循环执行到语句2，依次循环。
    for (m = 1; m <= 5; ++m)
    {
        printf("m=%d\t", m);
    }
    printf("\n");


    return 0;
}