////
//// Created by shuncs on 19-2-23.
////
//
//#include <stdio.h>
//
//int main(void)
//{
//    int a[5] = {3,444,25,136,17};
//    int *p = &a[4];
//
//    //数组指针---主要用于函数参数这一块
//    //数组指针本质是一个指针，它指向的是一个数组
//    //指针数组本质是一个数组，不过其存放的是指针
//    //变量是一个指针，指针指向数组类型
//    //下标运算符的优先级高于指针运算符
//    //int[5] *p1 ==> int *p1 [5] ==> int (*p1)[5]
//    //*p1 p1是一个指针。一定要加括号，不然p1就先跟[]结合了
//    //此时定义指针的时候，元素的个数也是非常重要的，个数也要相吻合
//    int (*p1)[5] = &a;
//
//    //利用数组指针输出元素
//    //*p1 == a
//    printf("%d\n",*(*p1+2));
//    printf("%d\n",(*p1)[2]);
//    printf("%p\n", (*p1+2));
//    printf("%p\n", &a[2]);
//
//    return 0;
//}