//
// Created by zhushuai on 19-2-16.
//

//#include <stdio.h>
//
//int main(void)
//{
//    //赋值运算符
//    //赋值运算符左侧必须是左值(变量)
//    //右侧可以是变量也可以是常量
//    int a = 12;
//
//    int b,  //后侧可以加注释
//        c,
//        d;
//
//    //执行顺序，从右向左执行;
//    //左侧是目标类型，计算机会把右侧的数据转换成左侧的数据类型
//    a = b = c = d = 13;
//
//    printf("%d, %d, %d, %d\n", a, b, c, d);
//
//    int h = 12 / 0.1;
//    printf("h=%d\n", h);
//
//    printf("%d %d\n", a++, ++b);
//    printf("%d %d\n", a, b);
//    printf("%d %d\n", a--, --b);
//
//    //自加自减不能在同一个语句中出现一次以上
//    a = 12;
//    //下列表达式在不同编译器中得到的结果是不同的
//    b = a++ + ++a + a++;
//    printf("%d\n", b);
//
//    return 0;
//}